ifr-ct/2025-Sentry/H723 digitalhead/Inc/stm32h7xx_hal_conf.h
/* Tip: To avoid modifying this file each time you need to use different HSE,
   ===  you can define the HSE value in your toolchain compiler preprocessor. */

/* ########################### System Configuration ######################### */
/**
  * @brief This is the HAL system configuration section
  */
#define  VDD_VALUE                    (3300UL) /*!< Value of VDD in mv */
#define  TICK_INT_PRIORITY            (15UL) /*!< tick interrupt priority */
#define  USE_RTOS                     0
#define  USE_SD_TRANSCEIVER           0U               /*!< use uSD Transceiver */
#define  USE_SPI_CRC	              0U               /*!< use CRC in SPI */

#define  USE_HAL_ADC_REGISTER_CALLBACKS     1U /* ADC register callback enabled     */
#define  USE_HAL_CEC_REGISTER_CALLBACKS     1U /* CEC register callback enabled     */
#define  USE_HAL_COMP_REGISTER_CALLBACKS    1U /* COMP register callback enabled    */
#define  USE_HAL_CORDIC_REGISTER_CALLBACKS  1U /* CORDIC register callback enabled  */
#define  USE_HAL_CRYP_REGISTER_CALLBACKS    1U /* CRYP register callback enabled    */
#define  USE_HAL_DAC_REGISTER_CALLBACKS     1U /* DAC register callback enabled     */
#define  USE_HAL_DCMI_REGISTER_CALLBACKS    1U /* DCMI register callback enabled    */
#define  USE_HAL_DFSDM_REGISTER_CALLBACKS   1U /* DFSDM register callback enabled   */
#define  USE_HAL_DMA2D_REGISTER_CALLBACKS   1U /* DMA2D register callback enabled   */
#define  USE_HAL_DSI_REGISTER_CALLBACKS     1U /* DSI register callback enabled     */
#define  USE_HAL_DTS_REGISTER_CALLBACKS     1U /* DTS register callback enabled     */
#define  USE_HAL_ETH_REGISTER_CALLBACKS     1U /* ETH register callback enabled     */
#define  USE_HAL_FDCAN_REGISTER_CALLBACKS   1U /* FDCAN register callback enabled   */
#define  USE_HAL_FMAC_REGISTER_CALLBACKS    1U /* FMAC register callback enabled  */
#define  USE_HAL_NAND_REGISTER_CALLBACKS    1U /* NAND register callback enabled    */
#define  USE_HAL_NOR_REGISTER_CALLBACKS     1U /* NOR register callback enabled     */
#define  USE_HAL_SDRAM_REGISTER_CALLBACKS   1U /* SDRAM register callback enabled   */
#define  USE_HAL_SRAM_REGISTER_CALLBACKS    1U /* SRAM register callback enabled    */
#define  USE_HAL_HASH_REGISTER_CALLBACKS    1U /* HASH register callback enabled    */
#define  USE_HAL_HCD_REGISTER_CALLBACKS     1U /* HCD register callback enabled     */
#define  USE_HAL_GFXMMU_REGISTER_CALLBACKS  1U /* GFXMMU register callback enabled  */
#define  USE_HAL_HRTIM_REGISTER_CALLBACKS   1U /* HRTIM register callback enabled   */
#define  USE_HAL_I2C_REGISTER_CALLBACKS     1U /* I2C register callback enabled     */
#define  USE_HAL_I2S_REGISTER_CALLBACKS     1U /* I2S register callback enabled     */
#define  USE_HAL_IRDA_REGISTER_CALLBACKS    1U /* IRDA register callback enabled    */
#define  USE_HAL_JPEG_REGISTER_CALLBACKS    1U /* JPEG register callback enabled    */
#define  USE_HAL_LPTIM_REGISTER_CALLBACKS   1U /* LPTIM register callback enabled   */
#define  USE_HAL_LTDC_REGISTER_CALLBACKS    1U /* LTDC register callback enabled    */
#define  USE_HAL_MDIOS_REGISTER_CALLBACKS   1U /* MDIO register callback enabled    */
#define  USE_HAL_MMC_REGISTER_CALLBACKS     1U /* MMC register callback enabled     */
#define  USE_HAL_OPAMP_REGISTER_CALLBACKS   1U /* MDIO register callback enabled    */
#define  USE_HAL_OSPI_REGISTER_CALLBACKS    1U /* OSPI register callback enabled    */
#define  USE_HAL_OTFDEC_REGISTER_CALLBACKS  1U /* OTFDEC register callback enabled  */
#define  USE_HAL_PCD_REGISTER_CALLBACKS     1U /* PCD register callback enabled     */
#define  USE_HAL_QSPI_REGISTER_CALLBACKS    1U /* QSPI register callback enabled    */
#define  USE_HAL_RNG_REGISTER_CALLBACKS     1U /* RNG register callback enabled     */
#define  USE_HAL_RTC_REGISTER_CALLBACKS     1U /* RTC register callback enabled     */
#define  USE_HAL_SAI_REGISTER_CALLBACKS     1U /* SAI register callback enabled     */
#define  USE_HAL_SD_REGISTER_CALLBACKS      1U /* SD register callback enabled      */
#define  USE_HAL_SMARTCARD_REGISTER_CALLBACKS  1U /* SMARTCARD register callback enabled */
#define  USE_HAL_SPDIFRX_REGISTER_CALLBACKS 1U /* SPDIFRX register callback enabled */
#define  USE_HAL_SMBUS_REGISTER_CALLBACKS   1U /* SMBUS register callback enabled   */
#define  USE_HAL_SPI_REGISTER_CALLBACKS     1U /* SPI register callback enabled     */
#define  USE_HAL_SWPMI_REGISTER_CALLBACKS   1U /* SWPMI register callback enabled   */
#define  USE_HAL_TIM_REGISTER_CALLBACKS     1U /* TIM register callback enabled     */
#define  USE_HAL_UART_REGISTER_CALLBACKS    1U /* UART register callback enabled    */
#define  USE_HAL_USART_REGISTER_CALLBACKS   1U /* USART register callback enabled   */
#define  USE_HAL_WWDG_REGISTER_CALLBACKS    1U /* WWDG register callback enabled    */

/* ########################### Ethernet Configuration ######################### */
#define ETH_TX_DESC_CNT         4U  /* number of Ethernet Tx DMA descriptors */
#define ETH_RX_DESC_CNT         4U  /* number of Ethernet Rx DMA descriptors */

#define ETH_MAC_ADDR0    (0x02UL)
#define ETH_MAC_ADDR1    (0x00UL)
#define ETH_MAC_ADDR2    (0x00UL)
#define ETH_MAC_ADDR3    (0x00UL)
#define ETH_MAC_ADDR4    (0x00UL)
#define ETH_MAC_ADDR5    (0x00UL)

/* ########################## Assert Selection ############################## */
/**
  * @brief Uncomment the line below to expanse the "assert_param" macro in the
  *        HAL drivers code
  */
/* #define USE_FULL_ASSERT    1U */

/* Includes ------------------------------------------------------------------*/
/**
  * @brief Include module's header file
  */

#ifdef HAL_RCC_MODULE_ENABLED
  #include "stm32h7xx_hal_rcc.h"
#endif /* HAL_RCC_MODULE_ENABLED */

#ifdef HAL_GPIO_MODULE_ENABLED
  #include "stm32h7xx_hal_gpio.h"
#endif /* HAL_GPIO_MODULE_ENABLED */

#ifdef HAL_DMA_MODULE_ENABLED
  #include "stm32h7xx_hal_dma.h"
#endif /* HAL_DMA_MODULE_ENABLED */

#ifdef HAL_MDMA_MODULE_ENABLED
 #include "stm32h7xx_hal_mdma.h"
#endif /* HAL_MDMA_MODULE_ENABLED */

